"use strict";

// let num = 50;

// // Цикл while ===================================================================================

// // Цикл while означає поки в нас умова виконується і вона є true, ми будемо робити якусь дію
// while(num <= 55) {
//     console.log(num);
//     num++;
// }

// Цикл do...while ===================================================================================

// // Цикл do...while означає що ми будемо виконувати певну дію поки умова є правдивою

// let num = 50;

// do {
//     console.log(num);
//     num++;
// }
// while (num < 55);



// Цикл for ===================================================================================


// for(let i = 1; i < 8; i++) {        // 1 2 3 4 5 6 7
//     console.log(i);
// }

// let num = 50;

// for(let i = 1; i < 8; i++) {
//     console.log(num);
//     num++;
// }


for(let i = 1; i < 10; i++) {
    if(i === 6) {
        // break;
        continue;
    }
    console.log(i);
}



// Не треба плутати цикли з методами перебору, такими як for...each, for...of та map

