// Задача. Выведите столбец чисел от 1 до 50.

// Решение: воспользуемся циклом while 
// (отделим числа тегом br друг от друга, чтобы получить столбец, а не строку):


// while ====================================================

// let i = 1;
// while(i <= 50) {
//     document.write(i + '</br>');
//     i++;
// }



// for ====================================================

// for(let i = 1; i <= 50; i++) {
//     document.write(i + '</br>');
// }



//  ==================================================== ====================================================

// Задача. Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.

// let arr = [1, 2, 3, 4, 5];

// for(let i = 0; i < arr.length; i++) {
//     document.write(arr[i] + '</br>');
// }


// let arr1 = ['apple', 'strawberry', 'potato', 'lime', 'avocado'];

// for(let i = 0; i < arr1.length; i++) {
//     document.write(arr1[i] + '</br>');
// }


//  ==================================================== ====================================================

// Задача. Дан массив с элементами [2, 3, 4, 5]. С помощью цикла for найдите произведение 
// элементов этого массива.

// Решение: для таких задач существует стандартное решение, которое заключается в том, 
// что циклом for перебираются элементы массива и их произведение последовательно 
// записывается в переменную result (в ней постепенно накапливается искомое произведение):

// let result = 1;
// let arr = [2, 3, 4, 5];

// for(let i = 0; i < arr.length; i++) {
//     result = result * arr[i];
// }
// document.write(result);






//  ==================================================== ====================================================








