// 1. =================================================== ====================================================

// Выведите с помощью цикла столбец чисел от 1 до 100. 

// for(let i = 1; i <= 100; i++) {
//     document.write(i + '</br>');
// }



// let i = 1;
// while(i <= 100) {
//     document.write(i + '</br>');
//     i++;
// }




// let i = 1;

// do {
//     document.write(i + '</br>');
//     i++;
// }
// while(i <= 100);



// 2. ================================================== ====================================================

// Выведите с помощью цикла столбец чисел от 100 до 1


// for(let i = 100; i >= 1; i--) {
//     document.write(i + '</br>');
// }



// let i = 100;
// while(i >= 1) {
//     document.write(i + '</br>');
//     i--;
// }


// let i = 100;

// do {
//     document.write(i + '</br>');
//     i--;
// }
// while(i >= 1);



// 3. ================================================== ====================================================

// Выведите с помощью цикла столбец четных чисел от 1 до 100


// for(let i = 2; i <= 100; i+=2) {
//     document.write(i + '</br>');
// }





// let i = 2;

// while(i <= 100) {
//     document.write(i + '</br>');
//     i+=2;
// }



// let i = 2;

// do {
//     document.write(i + '</br>');
//     i+=2;
// }
// while(i <= 100);



// 4. ================================================== ====================================================

// Заполните массив 10-ю иксами с помощью цикла


// let arr = [];

// for(let i = 0; i < 10; i++) {
//     arr[i] = 'x';
// }
// document.write(arr);




// 5. ================================================ ====================================================

// Заполните массив числами от 1 до 10 с помощью цикла.

// let arr = [];

// for(let i = 1; i <= 10; i++) {
//     arr.push(i);
// }

// document.write(arr);



// 6. ================================================ ====================================================

// Заполните массив 10-ю случайными числами (дробями) от 0 до 1 с помощью цикла.
// Дроби округляйте до двух знаков в дробной части.

// let arr = [];

// for(let i = 0; i < 10; i++) {
//     arr.push(Math.random().toFixed(2));
// }

// document.write(arr);



// 7. ================================================ ====================================================

// Заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла

// let arr = [];

// for(let i = 0; i < 10; i++) {
//     arr.push(Math.round(Math.random() * 10));
// }

// document.write(arr);


// 8. ================================================ ====================================================

// Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти

// arr = [1, 2, 4, -1, -3, 8, 7, 0, -5, 18, 12];

// for(let i = 0; i < arr.length; i++) {
//     if(arr[i] > 0 && arr[i] < 10) {
//         document.write(arr[i] + '</br>');
//     }
// }


// 9. ================================================ ====================================================

// Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5. 
// Как только будет найден первый такой элемент - выведите 'Есть' и оборвите цикл. 
// Если такого элемента нет - ничего не выводите

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

// for(let i = 0; i < arr.length; i++) {
//     if(arr[i] === 5) {
//         console.log('Есть');
//         break;
//     }
// }


// 10. ================================================ ====================================================

// Дан массив с числами. С помощью цикла найдите сумму элементов этого массива.

// let arr = [1, 2, 3, 4, 5];

// let sum = 0;

// for(let i = 0; i < arr.length; i++) {
//     sum = sum + arr[i];
// }

// console.log(sum);


// 11. ================================================ ====================================================

// Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива.

// let arr = [1, 2, 3, 4, 5];

// let sum = 0;

// for(let i = 0; i < arr.length; i++) {
//     sum = sum + (arr[i] * arr[i]);
// }

// console.log(sum);           // 55


// Квадрат числа - це коли число множиться само на себе, типу 5 * 5 = 25,  25 - це квадрат числа 5


// 11. ================================================ ====================================================

// Дан массив с числами. Найдите среднее арифметическое его элементов (сумма элементов, делить на количество)

let arr = [1, 2, 3, 7, 6, 9];

let sum = 0;

// let middleValue = 0;

for(let i = 0; i < arr.length; i++) {
    sum = sum + arr[i];

    // middleValue = sum / arr.length;
}

let middleValue = sum / arr.length;

console.log(middleValue);
